import { Injectable } from '@angular/core';
import { Article } from 'src/app/models/article';
import { Category } from 'src/app/models/category';

@Injectable({
  providedIn: 'root'
})
export class ArticleService {

  private articles: Article[] = [
    {
      id: 1,
      author: 'admin',
      title: 'Незабудка',
      categories: [
        { id: 5, title: 'Статті', link: '#' }
      ],
      // tslint:disable-next-line: max-line-length
      content:
        `
      <div>
      <p>
      Більшість масонів і масонство в цілому особливо уважно ставляться до спадщини людства.
       І найдосвідченіший Майстер Масон, і молодий Підмайстер можуть оцінити уроки і знання,
       доступні нам завдяки ретельному навчанню. Наша повага до мудрості гуманітарних і точних наук дає нам змогу побачити
       унікальні архітектурні основи і принципи побудови існуючого світу, а також отримати повагу до математичних чисел і букв.
       Крім того, ми, як і інші, бачимо внутрішню красу природнього світу, від величі сонця, зірок і місяця, до священної і
       урочистої символіки самої скромної рослини – акації. Бути масоном – значить володіти особливим даром, завжди шукати сенс,
       справжній або прихований, у навколишньому світі.
      </p>

      <p>
      «Незабудка» – це неофіційна назва квітки Myosotis, зазвичай відомої як маленька квітка з п’ятьма синіми або
       фіолетовими пелюстками. Історично вона займає місце в поезії Водсворта і Торо, в середньовічних німецьких легендах,
       в християнської агіографії і англійської політичної історії. Для масонів незабудка – це символ, який нагадує нам про
       стійкість і опір, а також про любов до Братерства і до його принципів, навіть при незгодах і переслідуваннях.
      </p>
      <p>
      З моменту свого створення в 1933 році нацистська Німеччина приділяла велику увагу пропаганді
       і досягненню позитивного суспільного сприйняття своїх ідеологічних цілей. Це включало правові,
       політичні та громадянські обмеження проти опонентів режиму і тих, хто став жертвою його жорстокої расової
       та соціальної ідеології. Поряд з євреями, гомосексуалістами, людьми із фізичними та розумовими вадами, католиками
       та  Свідками Єгови, масони стали об’єктом кримінального переслідування і виключення із суспільства.
       Це було досягнуто кількома способами. «Закон про дозвіл» 1933 року сприяв прийняттю у наступному році урядового указу,
       який офіційно розпустив всі масонські ложі у Третьому рейху, дозволив конфіскувати їх майно та офіційно заборонив членам,
       пов’язаним з масонством, вступати в нацистську партію. У 1934-5 роках Міністерство оборони ухвалило рішення, згідно якому
       солдати, офіцери і цивільний персонал армії не можуть бути членами масонських організацій, і Гітлер оголосив перемогу над
       «міжнародним єврейством», в якому він пов’язав антисемітизм з теоріями змови. Масони вважалися політичними в’язнями
       в німецькій системі концентраційних таборів, і тому були змушені носити значок перевернутого червоного трикутника.
      </p>
      </div>
      `,
      dateTime: new Date(2019, 9, 25, 13, 15)
    },
    {
      id: 2,
      author: 'admin',
      title: 'Легенда про Наріжний Камінь',
      categories: [
        { id: 5, title: 'Статті', link: '#' }
      ],
      // tslint:disable-next-line: max-line-length
      content: `У травні 6019 року на Сході міста Запоріжжя ДЛ:. «Паломники до країни Сходу» № 17 було проведено ритуал разом із дружинами, в якому йшла мова про старовинну масонську легенду про церемонію закладання наріжного каменю Храму Царя Соломона на пагорбі Моріа. У травні 6019 року на Сході міста Запоріжжя ДЛ:. «Паломники до країни Сходу» № 17 було проведено ритуал разом із дружинами, в якому йшла мова про старовинну масонську легенду про церемонію закладання наріжного каменю Храму Царя Соломона на пагорбі Моріа. У травні 6019 року на Сході міста Запоріжжя ДЛ:. «Паломники до країни Сходу» № 17 було проведено ритуал разом із дружинами, в якому йшла мова про старовинну масонську легенду про церемонію закладання наріжного каменю Храму Царя Соломона на пагорбі Моріа. У травні 6019 року на Сході міста Запоріжжя ДЛ:. «Паломники до країни Сходу» № 17 було проведено ритуал разом із дружинами, в якому йшла мова про старовинну масонську легенду про церемонію закладання наріжного каменю Храму Царя Соломона на пагорбі Моріа.`,
      dateTime: new Date(2019, 8, 25, 13, 15)
    },
    {
      id: 3,
      author: 'admin',
      title: 'Масонское Братство Украины: масоны в Запорожье представлены ДЛ “Паломники в страну Востока” №17.',
      categories: [
        { id: 1, title: 'Контакти', link: '#' }
      ],
      content: `<div><p>Вы находитесь на информационном сайте нашей Достопочтенной Ложи.</p>
      <p>Масонство существовало прежде знаменательного дня основания
       Объединенной Великой Ложи Англии, его корни уходят в туман веков.
       Братство было, остается и будет в дальнейшем системной организацией.
       Также, за много лет до основания нашей Мастерской, Братьями-единомышленниками
       (которые в дальнейшем стали ее учредителями) проводились объемные и вдохновенные
       работы по подготовке центрального региона к принятию истинного Света.</p>
      <p>Многие области центра и востока нашей родины хотели создать Ложу в своем городе,
       но, волей Великого Архитектора Вселенной и благодаря Братьям, именно в городе Запорожье
        была создана Достопочтенная Ложа № 17 с особым названием «Паломники в страну Востока».
         Целый ряд испытаний и сложностей пришлось пережить и преодолеть Братьям-основателям,
          но несмотря на всевозможные трудности они выстояли, поддерживая и вдохновляя друг
           друга для достижения общей цели. Благодаря братской поддержке и помощи Д:.Л:.«Три колонны» 12 ноября 2016 г.
            произошли сразу два исторических события: впервые в нашем городе была проведена Генеральная ассамблея В:.Л:.У:.
             и основана Достопочтенная Ложа.</p>
      <p>В ходе основания Д:.Л:. «Паломники в страну Востока» Великим Мастером Украины был вручен патент на проведение работ,
       который хранится в нашей Ложе с момента инсталляции.</p>
      <p>Сегодня Д:.Л:. «Паломники в страну Востока» активно проводит свои работы во Славу Великого Архитектора Вселенной,
       отворяя дверь стучащим, и делая Братьев Ложи и Мир лучшими в масонском понимании.</p>
      <p>Наш канал на YouTube: <a href="https://www.youtube.com/channel/UCmv7TKt_vlM7WQ5-lUxZaPw">ссылка<a></p>
      <p>Связаться с нами можно по электронной почте:  journey_east@ukrmason.org.</p>
      </div>`,
      dateTime: new Date(2019, 7, 25, 13, 15)
    }
  ];

  constructor() { }

  getArticles(category?: Category) {
    if (category == null) {
      return this.articles;
    } else {
      return this.articles
        .filter(a => {
          let result = false;
          for (const cat of a.categories) {
            if (cat.id === category.id) {
              result = true;
              break;
            }
          }
          return result;
        });
    }
  }

  getArticle(id: number) {
    return this.articles.filter(a => a.id === id)[0];
  }

  addArticle(article: Article) {
    article.id = this.getMaxId() + 1; // should be removed, if we call server
    this.articles.push(article);

    console.log(article);
    console.log(this.articles.length);
  }

  private getMaxId() {
    let max = 0;
    for (const article of this.articles) {
      max = article.id > max ? article.id : max;
    }
    return max;
  }
}
