import { Injectable } from '@angular/core';
import { Article } from 'src/app/models/article';

@Injectable({
  providedIn: 'root'
})
export class ArticleService {

  articles: Article[] = [
    {
      id: 1,
      author: 'admin',
      title: 'Незабудка',
      categories: [
        { id: 1, title: 'Статті', link: '/' }
      ],
      // tslint:disable-next-line: max-line-length
      content: `Більшість масонів і масонство в цілому особливо уважно ставляться до спадщини людства. І найдосвідченіший Майстер Масон, і молодий Підмайстер можуть оцінити уроки і знання, доступні нам завдяки ретельному навчанню. Наша повага до мудрості гуманітарних і точних наук дає нам змогу побачити унікальні архітектурні основи і принципи побудови існуючого світу, а також отримати повагу до математичних чисел і букв. Крім того, ми, як і інші, бачимо внутрішню красу природнього світу, від величі сонця, зірок і місяця, до священної і урочистої символіки самої скромної рослини – акації. Бути масоном – значить володіти особливим даром, завжди шукати сенс, справжній або прихований, у навколишньому світі. «Незабудка» – це неофіційна назва квітки Myosotis, зазвичай відомої як маленька квітка з п’ятьма синіми або фіолетовими пелюстками. Історично вона займає місце в поезії Водсворта і Торо, в середньовічних німецьких легендах, в християнської агіографії і англійської політичної історії. Для масонів незабудка – це символ, який нагадує нам про стійкість і опір, а також про любов до Братерства і до його принципів, навіть при незгодах і переслідуваннях.`
    },
    {
      id: 2,
      author: 'admin',
      title: 'Легенда про Наріжний Камінь',
      categories: [
        { id: 1, title: 'Статті', link: '/' }
      ],
      // tslint:disable-next-line: max-line-length
      content: `У травні 6019 року на Сході міста Запоріжжя ДЛ:. «Паломники до країни Сходу» № 17 було проведено ритуал разом із дружинами, в якому йшла мова про старовинну масонську легенду про церемонію закладання наріжного каменю Храму Царя Соломона на пагорбі Моріа. У травні 6019 року на Сході міста Запоріжжя ДЛ:. «Паломники до країни Сходу» № 17 було проведено ритуал разом із дружинами, в якому йшла мова про старовинну масонську легенду про церемонію закладання наріжного каменю Храму Царя Соломона на пагорбі Моріа. У травні 6019 року на Сході міста Запоріжжя ДЛ:. «Паломники до країни Сходу» № 17 було проведено ритуал разом із дружинами, в якому йшла мова про старовинну масонську легенду про церемонію закладання наріжного каменю Храму Царя Соломона на пагорбі Моріа. У травні 6019 року на Сході міста Запоріжжя ДЛ:. «Паломники до країни Сходу» № 17 було проведено ритуал разом із дружинами, в якому йшла мова про старовинну масонську легенду про церемонію закладання наріжного каменю Храму Царя Соломона на пагорбі Моріа.`
    },
  ];

  constructor() { }

  getArticles() {
    return this.articles;
  }

  getArticle(id: number) {
    return this.articles.filter(a => a.id === id)[0];
  }
}
